test/graphs/graph_test_04.dot
digraph unix {
  graph [ dpi = 72 ]; 
  graph [nodesep = 0.25; ranksep=0.25];
  fontname="Arial"
  node [fontname="Arial"]
  edge [fontname="Arial"]
  subgraph cluster_level3_57 {
    label = "level3"; // scope
    s111_108 [
      label = "s111"; // node
    ];
    c111_122 [
      label = "c111"; // node
    ];
    subgraph cluster_level2_58 {
      label = "level2"; // scope
      s11_109 [
        label = "s11"; // node
      ];
      s10_110 [
        label = "s10"; // node
      ];
      s01_111 [
        label = "s01"; // node
      ];
      s00_112 [
        label = "s00"; // node
      ];
      c00_118 [
        label = "c00"; // node
      ];
      c01_119 [
        label = "c01"; // node
      ];
      c10_120 [
        label = "c10"; // node
      ];
      c11_121 [
        label = "c11"; // node
      ];
      subgraph cluster_level1_59 {
        label = "level1"; // scope
        s1_113 [
          label = "s1"; // node
        ];
        s0_114 [
          label = "s0"; // node
        ];
        c0_116 [
          label = "c0"; // node
        ];
        c1_117 [
          label = "c1"; // node
        ];
        subgraph cluster_level0_60 {
          label = "level0"; // scope
          x_115 [
            label = "x"; // node
          ];
          
        }
        
      }
      
    }
    
  }
  "s111_108" -> "s11_109";
  "s11_109" -> "s1_113";
  "s10_110" -> "s1_113";
  "s01_111" -> "s0_114";
  "s00_112" -> "s0_114";
  "c11_121" -> "c111_122";
  "s1_113" -> "x_115";
  "s0_114" -> "x_115";
  "c0_116" -> "c00_118";
  "c0_116" -> "c01_119";
  "c1_117" -> "c10_120";
  "c1_117" -> "c11_121";
  "x_115" -> "c0_116";
  "x_115" -> "c1_117";
}
